Repository: Dshauchuk/pango
Catalog: src/Presentation/Desktop/Pango.Desktop.Uwp/Strings/*/Resources.resw
Source language: en_us
Languages: be_by

source: Appearance
be_by: Выгляд

source: Autolock
be_by: Аўтаблакіроўка

# AutolockDescription
source: Automatically locks the app after chosen period of device inactivity
be_by: Аўтаматычна блакіруе праграму пасля выбранага перыяду бяздзейнасці прылады

source: Add new password
be_by: Дадайце новы пароль

source: Back
be_by: Назад

source: Change User
be_by: Змяніць Карыстальніка

# ClearCopiedData
source: Clear copied item data
be_by: Ачысціць скапіраваныя даныя элемента

# ClearCopiedDataDescription
source: Automatically clears copied details from clipboard after insertion
be_by: Аўтаматычна ачышчае скапіраваныя дэталі з буфера абмену пасля ўстаўкі

source: Copy password
be_by: Скапіраваць пароль

source: Delete password
be_by: Выдаліць пароль

source: Edit password
be_by: Рэдагаваць пароль

# EnterMasterCode
source: Enter password
be_by: Увядзіце пароль

# Greeting.Text
source: Hello
be_by: Прыветанне

source: Home
be_by: Галоўная

source: Launch at startup
be_by: Запуск пры загрузцы сістэмы

source: Mastercode
be_by: Код

source: Other
be_by: Іншае

source: My Passwords
be_by: Мае Паролі

source: New
be_by: Новы

source: Passwords
be_by: Паролі

source: Search passwords
be_by: Пошук пароляў

source: Secrets
be_by: Сакрэты

source: Security
be_by: Бяспека

# SelectUser
source: Select a User
be_by: Абярыце Карыстальника

source: Settings
be_by: Налады

source: Sign In
be_by: Увайсці

# Switcher_Off
source: Off
be_by: Выкл.

# Switcher_On
source: On
be_by: Укл.

source: Theme
be_by: Тэма

source: User
be_by: Карыстальнік

source: User Info
be_by: Інфармацыя пра карыстальніка

source: Choose application language
be_by: Выберыце мову праграмы

source: Language
be_by: Мова

source: Cancel
be_by: Адмяніць

source: Email or username
be_by: Электронная пошта або імя карыстальніка

source: Login
be_by: Імя карыстальніка

source: New password
be_by: Новы пароль

source: Password
be_by: Пароль

source: Save
be_by: Захаваць

source: Title
be_by: Назва

# PasswordCopiedToClipboard
source: Password has been copied to clipboard
be_by: Пароль скапіраваны ў буфер абмену

source: Add Password
be_by: Дадаць пароль

# NoPasswordsYet
source: You have no passwords yet
be_by: У вас яшчэ няма пароляў

# CreateUser
source: Create a User
be_by: Дадаць Карыстальника

# OrCreateUser
source: or Create a New User
be_by: Або стварыць новага карыстальника

source: Password Confirmation
be_by: Пацвярджэнне пароля

source: User name
be_by: Імя карыстальніка

source: Password Confirmation does not match
be_by: Паролі не супадаюць

source: Loading
be_by: Загрузка

# PasswordCreated
source: Password "{0}" has been successfully added
be_by: Пароль "{0}" быў паспяхова дададзены

# PasswordModified
source: Password "{0}" has been successfully updated
be_by: Пароль "{0}" быў паспяхова абноўлены

source: Creation date
be_by: Дата стварэння

source: Delete User
be_by: Выдаліць Карыстальника

# AppTheme_Dark
source: Dark
be_by: Цёмная

# AppTheme_Default
source: Default
be_by: Па змаўчанні

# AppTheme_Light
source: Light
be_by: Светлая

source: Yes
be_by: Так

# Confirm_PasswordDeletion
source: Delete the password?
be_by: Выдаліць пароль?

# Confirm_PasswordDeletionDetails
source: The password will be deleted permanently. Do you want to continue?
be_by: Пароль будзе выдалены назаўсёды. Вы хочаце працягнуць?

# NewCatalogDialogTitle
source: Add New Catalog
be_by: Дадаць Каталог

# NewCatalogName
source: New Catalog
be_by: Новы каталог

source: Add new catalog
be_by: Дадаць каталог

source: Or
be_by: Або

source: Delete
be_by: Выдаліць

source: Edit
be_by: Рэдагаваць

# EditCatalogDialogTitle
source: Edit Catalog
be_by: Рэдагаваць Каталог

# RemoveCatalog_Message
source: The catalog "{0}" containing {1} passwords will be removed. Do you want to continue?
be_by: Каталог "{0}", які змяшчае {1} пароляў, будзе выдалены. Працягнуць?

# AutolockAfterMinutes
source: Lock after minutes
be_by: Заблакіраваць праз хвіліны

source: minute(-s)
be_by: хвілін(-ы)

# PasswordDeleted_Format
source: Password "{0}" has been successfully deleted
be_by: Пароль "{0}" быў паспяхова выдалены

# PasswordDeletetionFailed_Format
source: Failed to delete password "{0}"
be_by: Не атрымалася выдаліць пароль "{0}"

# CatalogCreated_Format
source: Catalog "{0}" has been successfully created
be_by: Каталог "{0}" быў дададзены

# CatalogCreationFailed_Format
source: Failed to create catalog "{0}"
be_by: Не атрымалася дадаць каталог "{0}"

# CatalogUpdated_Format
source: Catalog "{0}" has been successfully updated
be_by: Каталог "{0}" быў абноўлены

# CatalogUpdateFailed_Format
source: Failed to update catalog "{0}"
be_by: Не атрымалася абнавіць каталог "{0}"

source: No passwords found
be_by: Паролі не знойдзены

# AboutApp
source: About
be_by: Аб дадатку

# Confirm_UserDeletion
source: User {0} and all his passwords will be deleted. Do you want to continue?
be_by: Карыстальнік {0} і ўсе яго паролі будуць выдалены. Вы хочаце працягнуць?

# UpdatePasswordList
source: Refresh
be_by: Аднавіць

source: Password Details
be_by: Дэталі Пароля

source: Ok
be_by: Ок

# SeePassword
source: Show Password
be_by: Паказаць Пароль

# Message_LoginEmpty
source: Login failed for user "{0}": User name or password is empty
be_by: Памылка ўваходу для карыстальніка "{0}": імя карыстальніка або пароль пустыя

# Message_LoginError
source: Login failed for user "{0}": {1}. {2}
be_by: Памылка ўваходу для карыстальніка "{0}": {1}. {2}

# Message_LoginFailed
source: Login failed for user "{0}": User name or password is wrong
be_by: Памылка ўваходу для карыстальніка "{0}": імя карыстальніка або пароль няправільныя

# Message_LoginSuccess
source: Authentication succeeded
be_by: Аўтэнтыфікацыя прайшла паспяхова

source: Cannot save password
be_by: Немагчыма захаваць пароль

# CapsLockWarningText
source: Having caps-lock turned on might result in incorrect password
be_by: Калі Caps Lock уключаны, пароль можа быць няправільным

# Notes_Label
source: Notes
be_by: Нататкі

# Notes_Placeholder
source: Any notes like secret questions, references, etc.
be_by: Любыя нататкі, такія як сакрэтныя пытанні, спасылкі і г.д.

source: Change password
be_by: Змяніць пароль

# ChangePasswordDialogTitle
source: Change Password
be_by: Змяніць пароль

# ChangePassword_Label
source: Change Password
be_by: Змяніць пароль

# Confirmation_Label
source: Confirmation
be_by: Пацверджанне

# CurrentPassword_Label
source: Current Password
be_by: Бягучы пароль

# NewPassword_Label
source: New Password
be_by: Новы пароль

source: Password has been changed
be_by: Пароль быў зменены

source: Password is not correct
be_by: Пароль няправільны

source: Export and Import
be_by: Экспарт і імпарт

# ExportAndImportDescriptionLabel
source: You can prepare and export some passwords to share with other devices and users, or you can import already exported data
be_by: Вы можаце падрыхтаваць і экспартаваць некаторыя паролі, каб падзяліцца імі з іншымі прыладамі і карыстальнікамі, або вы можаце імпартаваць ужо экспартаваныя дадзеныя

# ExportAndImportTooltip
source: Export and import of data
be_by: Экспарт і імпарт дадзеных

# ExportDataButtonContent
source: Export
be_by: Экспарт

# ExportTitle
source: Export
be_by: Экспарт

# ImportDataButtonContent
source: Import
be_by: Імпарт

# ImportTitle
source: Import
be_by: Імпарт

# ExportResultTitle
source: Export Results
be_by: Вынікі Экспарту

# ImportSingleCompleted_Message
source: Import completed: 1 password was imported successfully.
be_by: Імпарт завершаны: 1 пароль быў паспяхова імпартаваны.

# ImportCompleted_Message
source: Import completed: {0} passwords were imported successfully.
be_by: Імпарт завершаны: {0} пароляў былі паспяхова імпартаваны.

# SelectFile_Title
source: Select a file...
be_by: Выберыце файл...

# SelectFile_Hint
source: Select a file that contains pango data (.pngx file)
be_by: Выберыце файл, які змяшчае дадзеныя pango (файл .pngx)

# Select_Button
source: Select
be_by: Выбраць

# ImportMasterKey_Label
source: The archive is encrypted - please enter the key
be_by: Архіў зашыфраваны - калі ласка, увядзіце ключ

source: Content
be_by: Змест

# Content_FormattedValueLabel
source: {0} passwords
be_by: {0} пароляў

# CatalogDeleted_FormattedMessage
source: Catalog "{0}" has been successfully deleted
be_by: Каталог "{0}" быў паспяхова выдалены

source: Description
be_by: Апісанне

# AskForDescription_Label
source: Provide some description here
be_by: Дайце нейкае апісанне

# ExportCompletedContent_FormattedLabel
source: {0} passwords exported
be_by: Экспартавана {0} пароляў

source: File
be_by: Файл

source: Folder
be_by: Папка

# PackageDetails_Label
source: Package Details
be_by: Дэталі пакета

source: Version
be_by: Версія

# GeneratingTimestamp_Label
source: Generated at
be_by: Згенераваны ў

# GeneratedPackage_Label
source: Generated Package
be_by: Згенераваны Пакет

# ArchiveEncryptionPassword_Placeholder
source: Password for the archive encryption
be_by: Пароль для шыфравання архіва

# TooManyUsers
source: The maximum number of users has been reached
be_by: Дасягнута максімальная колькасць карыстальнікаў

# UserRegistrationFailed
source: Registration error
be_by: Памылка рэгістрацыі

source: Export folder path
be_by: Шлях да папкі экспарту

# SelectExportFolder_Placeholder
source: Select folder for export
be_by: Абярыце папку для экспарту

# SelectFolder
source: Select
be_by: Абраць

# SelectExportFolder_Tooltip
source: Click to select folder for saving exported file
be_by: Націсніце, каб абраць папку для захавання экспартаванага файла

source: Select items to export
be_by: Выберыце элементы для экспарту

# ValidationError_Required
source: This field is required.
be_by: Гэта поле абавязковае.

# ValidationError_MinLength
source: Minimum length is 3 characters.
be_by: Мінімальная даўжыня — 3 сімвалы.

# ValidationError_ExportPath
source: Selected folder does not exist or is invalid.
be_by: Выбраная папка не існуе альбо шлях няправільны.

source: File Name
be_by: Назва файла

# FileName_Placeholder
source: Enter file name (without extension)
be_by: Увядзіце назву (без пашырэння)

# ValidationError_InvalidFileName
source: Name contains invalid characters.
be_by: Назва ўтрымлівае недапушчальныя сімвалы.

# Export_FileExistsTitle
source: File already exists
be_by: Файл ужо існуе

# ValidationError_FileExists
source: A file with this name already exists in the selected folder.
be_by: Файл з такой назвай ужо існуе ў абранай папцы.

# GeneratePassword_Title
source: Password generator
be_by: Генератар пароляў

source: Password strength
be_by: Надзейнасць пароля

source: Password length
be_by: Даўжыня пароля

source: Characters to use
be_by: Сiмвалы для выкарыстання

# UseUppercase
source: Uppercase letters (A–Z)
be_by: Вялікія літары (A–Z)

# UseLowercase
source: Lowercase letters (a–z)
be_by: Маленькія літары (a–z)

# UseDigits
source: Digits (0–9)
be_by: Лічбы (0–9)

# UseSpecial
source: Special characters
be_by: Асаблівыя сімвалы

# ExcludeAmbiguousCharacters
source: Exclude ambiguous characters (Il10oOsS5)
be_by: Выключыць неадназначныя сімвалы (Il10oOsS5)

source: Generate
be_by: Згенераваць

source: Apply
be_by: Ужыць

# PasswordStrength_Strong
source: Strong
be_by: Моцны

# PasswordStrength_Medium
source: Medium
be_by: Сярэдні

# PasswordStrength_Weak
source: Weak
be_by: Слабы

# PasswordGeneration_Error_NoCharSet
source: Select at least one character set.
be_by: Абярыце хаця б адзін набор сімвалаў.

# PasswordGeneration_Error_LengthOutOfRange
source: Password length must be between 8 and 64 characters.
be_by: Даўжыня пароля павінна быць ад 8 да 64 сімвалаў.

# GeneratePassword
source: Password generator
be_by: Генератар пароляў

# GeneratePasswordTooltip
source: Create a strong password
be_by: Стварыць надзейны пароль

# PasswordLengthTooltip
source: Password length (8–64 characters)
be_by: Даўжыня пароля (8-64 сімвала)

# PasswordLengthUnits
source: chars
be_by: сімвалы

# UseUppercaseTooltip
source: Add uppercase letters (A–Z) to increase password strength
be_by: Дадайце загалоўныя літары (A-Z), каб павысіць надзейнасць пароля

# UseDigitsTooltip
source: Add digits (0–9) to increase password strength
be_by: Дадайце лічбы (0-9), каб павысіць надзейнасць пароля

# UseLowercaseTooltip
source: Add lowercase letters (a–z) to increase password strength
be_by: Дадайце малыя літары (A-z), каб павысіць надзейнасць пароля

# ExcludeAmbiguousTooltip
source: Exclude characters that can look similar (Il10oOsS5)
be_by: Выключыць сімвалы, якія могуць выглядаць падобнымі (Il10oOsS5)

# UseSpecialTooltip
source: Add special characters to make the password harder to guess
be_by: Дадайце спецыяльныя сімвалы, каб абцяжарыць падбор пароля

# PasswordLength_OutOfRange
source: Password length must be between 8 and 64 characters
be_by: Даўжыня пароля павінна складаць ад 8 да 64 сімвалаў

# PasswordLength_Invalid
source: Invalid password length value
be_by: Недапушчальнае значэнне даўжыні пароля

# RegeneratePassword
source: Generate new password
be_by: Стварыць новы пароль

# OtherPasswords
source: Other suggested passwords
be_by: Іншыя прапанаваныя паролі

source: Password generated successfully
be_by: Пароль паспяхова згенераваны

source: Save as
be_by: Захаваць як

# BackupSettings_Header
source: Backup
be_by: Рэзервовае капіраванне

# BackupPath_Label
source: Storage Path
be_by: Шлях захавання

# Browse_Button
source: Browse...
be_by: Агляд...

# DefaultPath_Button
source: Default path
be_by: Шлях па змаўчанні

# OpenFolder_Button
source: Open folder
be_by: Адкрыць папку

# BackupInterval_Label
source: Frequency
be_by: Перыядычнасць

source: hour(s)
be_by: гадзін(-ы)

# BackupSaved_Message
source: Backup settings saved.
be_by: Налады бэкапу захаваны.

# BackupPathInvalid_Error
source: Invalid path.
be_by: Няправільны шлях.

source: Save Changes
be_by: Захаваць змены

# BackupService_Toggle
source: Enable Background Backup Service
be_by: Уключыць фонавую службу бэкапу

# BackupPassword_Label
source: Backup Password (Auto-generated)
be_by: Пароль рэзервовай копіі (аўтаматычны)

# BackupPassword_Tooltip
source: This password is used to encrypt your backup files. You will need it to import/restore data.
be_by: Гэты пароль выкарыстоўваецца для шыфравання файлаў. Ён спатрэбіцца для аднаўлення.

# Import_EncryptedArchiveError
source: The archive is encrypted. Please ensure you entered the correct backup password.
be_by: Архіў зашыфраваны. Праверце правільнасць пароля.

# Theme_Default
source: System Default
be_by: Як у сістэме

# Theme_Light
source: Light
be_by: Светлая

# Theme_Dark
source: Dark
be_by: Цёмная

# BackupRetention_Label
source: Keep backups for
be_by: Захоўваць копіі

source: day(s)
be_by: дзён/дні

# BugRequest_Header
source: File a bug or request new feature
be_by: Паведаміць пра памылку ці прапанаваць функцыю

# Copyright_Description
source: © 2026 Cats Lab. All rights reserved.
be_by: © 2026 Cats Lab. Усе правы абаронены.

# ToggleSwitch_On
source: On
be_by: Укл.

# ToggleSwitch_Off
source: Off
be_by: Выкл.

# BackupServiceDescription
source: Automatically save encrypted copies of your data
be_by: Аўтаматычна захоўваць зашыфраваныя копіі вашых даных

# ImportSettings_Header
source: Import
be_by: Імпарт

# ImportDestination_Label
source: Destination
be_by: Месца прызначэння

# ImportDestination_Description
source: Choose where imported items will be placed
be_by: Выберыце, куды будуць змешчаны імпартаваныя элементы

# ImportDestination_Root
source: Import into root directory
be_by: Імпартаваць у каранёвы каталог

# ImportDestination_Folder
source: Import into separate folder
be_by: Імпартаваць у асобную папку

source: Select items to import
be_by: Выберыце элементы для імпарту

# ImportPreview_Loading
source: Reading file structure...
be_by: Чытанне структуры файла...

# ValidationError_CatalogExists
source: Folder already exists.
be_by: Папка ўжо існуе.

# ValidationError_InvalidChars
source: Invalid characters in the name.
be_by: Нядзейсныя знакі ў назве.

source: Data storage
be_by: Сховішча дадзеных

source: Reset
be_by: Скід

source: Choose data folder
be_by: Выберыце тэчку з дадзенымі

# DataFolderChanged
source: The folder has been changed. Please restart the application.
be_by: Папка зменена. Калі ласка, перазапусціце прыкладанне.

# Tray_OpenPango
source: Open Pango
be_by: Адкрыць Pango

# Tray_Exit
source: Exit
be_by: Выйсці

# Tray_StartBackup
source: Start Background Backup
be_by: Запусціць фонавы бэкап

# Tray_StopBackup
source: Stop Background Backup
be_by: Спыніць фонавы бэкап

# Tray_CloseWindow
source: Close to Tray
be_by: Схаваць у трэй

# Home_WelcomeTitle
source: Welcome to Pango
be_by: Сардэчна запрашаем у Pango

source: Copying data...
be_by: Капіяванне дадзеных...

source: Updating configuration...
be_by: Абнаўленне канфігурацыі...

# DataFolderChangeFailed
source: Failed to change data folder
be_by: Не атрымалася змяніць тэчку з дадзенымі

# PleaseDoNotCloseApp
source: Please don't close the app
be_by: Калі ласка, не зачыняйце прыкладанне

source: Change data folder
be_by: Змена тэчцы з дадзенымі

# ChangeDataFolder_Confirmation
source: Are you sure you want to change the data storage location?
be_by: Хочаце змяніць месца захоўвання дадзеных?

source: Show favorites
be_by: Паказаць Выбранае
